0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.002 0 0);

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           uniform (0.002 0 0);
    }

    Outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    frontback
    {
	type		noSlip;
    }
    support
    {
	type		zeroGradient;
    }
}

// ************************************************************************* //
